Revit 2027 API
ParameterTypeId.BoundaryLinearRestraintZ Property
 "Z Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryLinearRestraintZ { get; }
Public Shared ReadOnly Property BoundaryLinearRestraintZ As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryLinearRestraintZ {
	ForgeTypeId^ get ();
}
static member BoundaryLinearRestraintZ : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace